# IsValidSelector Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalElement..::..IsValidSelector Method
AnalyticalElement Class See Also
---
Indicates if the input selector is valid for the Analytical Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2023
# Syntax
C#
---
```text
public bool IsValidSelector(
	AnalyticalModelSelector selector
)
```

Visual Basic
---
```text
Public Function IsValidSelector ( _
	selector As AnalyticalModelSelector _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidSelector(
	AnalyticalModelSelector^ selector
)
```

# ### Parameters
selector
    Type: Autodesk.Revit.DB.Structure..::..AnalyticalModelSelector Portion of the Analytical Element geometry.
# ### Return Value
True if selector is valid for this Analytical Element, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
AnalyticalElement Class
Autodesk.Revit.DB.Structure Namespace